ext_alsav/InformationRegisters/алсав_НумерацияДляHOFF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсав_НумерацияДляHOFF</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Позиция_HOFF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция_АЛСАВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_НумерацияДляHOFF/Ext/ManagerModule.bsl
Функция ПолучитьПотребностьДляНумерации(ПродуктНоменклатура, ПродуктХарактеристика) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	0 КАК Х
	               |ПОМЕСТИТЬ Таб1
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	М.Х + 2 * С.Х КАК Х
	               |ПОМЕСТИТЬ Таб2
	               |ИЗ
	               |	Таб1 КАК М,
	               |	Таб1 КАК С
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	М.Х + 4 * С.Х КАК Х
	               |ПОМЕСТИТЬ Таб3
	               |ИЗ
	               |	Таб2 КАК М,
	               |	Таб2 КАК С
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	М.Х + 16 * С.Х КАК Х
	               |ПОМЕСТИТЬ Таб4
	               |ИЗ
	               |	Таб3 КАК М,
	               |	Таб3 КАК С
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	М.Х + 256 * С.Х КАК Х
	               |ПОМЕСТИТЬ РезТаб
	               |ИЗ
	               |	Таб4 КАК М,
	               |	Таб4 КАК С
	               |ГДЕ
	               |	М.Х + 256 * С.Х > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |	алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |	алсав_СоставИзделий.Номенклатура КАК Номенклатура,
	               |	алсав_СоставИзделий.Характеристика КАК Характеристика,
	               |	алсав_СоставИзделий.ПутьВСборке КАК ПутьВСборке,
	               |	алсав_СоставИзделий.Количество КАК Количество,
	               |	Т.Количество КАК КоличествоВсего,
	               |	РезТаб.Х КАК Х
	               |ИЗ
	               |	РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |			алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |			СУММА(алсав_СоставИзделий.Количество) КАК Количество
	               |		ИЗ
	               |			РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	               |		ГДЕ
	               |			алсав_СоставИзделий.ЭтоМатериалы = ЛОЖЬ
	               |			И алсав_СоставИзделий.ЭтоПолуфабрикат = ЛОЖЬ
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			алсав_СоставИзделий.ПродуктНоменклатура,
	               |			алсав_СоставИзделий.ПродуктХарактеристика) КАК Т
	               |		ПО (Т.ПродуктНоменклатура = алсав_СоставИзделий.ПродуктНоменклатура)
	               |			И (Т.ПродуктХарактеристика = алсав_СоставИзделий.ПродуктХарактеристика)
	               |			И (Т.Количество >= алсав_СоставИзделий.Количество)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РезТаб КАК РезТаб
	               |		ПО (РезТаб.Х <= алсав_СоставИзделий.Количество)
	               |ГДЕ
	               |	алсав_СоставИзделий.ПродуктНоменклатура = &ПродуктНоменклатура
	               |	И алсав_СоставИзделий.ПродуктХарактеристика = &ПродуктХарактеристика
	               |	И алсав_СоставИзделий.ЭтоМатериалы = ЛОЖЬ
	               |	И алсав_СоставИзделий.ЭтоПолуфабрикат = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПутьВСборке,
	               |	РезТаб.Х";
	
	Запрос.УстановитьПараметр("ПродуктНоменклатура",ПродуктНоменклатура);
	Запрос.УстановитьПараметр("ПродуктХарактеристика",ПродуктХарактеристика); 
	
	резалт = Запрос.Выполнить().Выгрузить(); 
	
	// Создаём квалификаторы для строки: длина 10 символов
	КвалификаторыСтроки = Новый КвалификаторыСтроки(10);

	// Описываем тип данных: строка с заданными квалификаторами
	ОписаниеТипаСтрока10 = Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);

	резалт.Колонки.Добавить("Позиция",ОписаниеТипаСтрока10);
	позиция = 0;
	Для Каждого стр из резалт Цикл  
		позиция = позиция + 1;
		стр.Позиция = ""+позиция + "/" + стр.КоличествоВсего
	КонецЦикла;	
	Возврат резалт;     
	
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	тчНумерация.ПродуктНоменклатура КАК ПродуктНоменклатура,
	//	               |	тчНумерация.ПродуктХарактеристика КАК ПродуктХарактеристика,
	//	               |	тчНумерация.Номенклатура КАК Номенклатура,
	//	               |	тчНумерация.Характеристика КАК Характеристика,
	//	               |	тчНумерация.ПутьВСборке КАК ПутьВСборке,
	//	               |	тчНумерация.Позиция КАК Позиция
	//	               |ПОМЕСТИТЬ ВнутренняяТаблицаАвтомобиле
	//	               |ИЗ
	//	               |	&тчНумерация КАК тчНумерация
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	т.ПутьВСборке КАК ПутьВСборке,
	//	               |	т.Позиция КАК Позиция
	//	               |ИЗ
	//	               |	тчНумерация КАК т
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алсав_НумерацияДляHOFF КАК ТХ
	//	               |		ПО т.ПродуктНоменклатура = ТХ.ПродуктНоменклатура
	//	               |			И т.ПродуктХарактеристика = ТХ.ПродуктХарактеристика
	//	               |			И т.Номенклатура = ТХ.Номенклатура
	//	               |			И т.Характеристика = ТХ.Характеристика
	//	               |			И т.ПутьВСборке = ТХ.ПутьВСборке
	//	               |			И т.Позиция = ТХ.Позиция_АЛСАВ
	//	               |ГДЕ
	//	               |	т.ПродуктНоменклатура = &ПродуктНоменклатура
	//	               |	И т.ПродуктХарактеристика = &ПродуктХарактеристика
	//	               |	И т.Номенклатура = &Номенклатура
	//	               |	И т.Характеристика = &Характеристика
	//	               |	И ТХ.ПутьВСборке ЕСТЬ NULL
	//	               |	И т.ЭтоМатериалы = ЛОЖЬ
	//	               |	И т.ЭтоПолуфабрикат = ЛОЖЬ
	//	               |
	//	               |УПОРЯДОЧИТЬ ПО
	//	               |	т.ПутьВСборке,
	//	               |	т.Позиция";
	//

КонецФункции
